const textsData = [
    {
        text: "الإبداع هو القدرة على رؤية ما لا يراه الآخرون، وفعل ما لم يجرؤ عليه أحد من قبل.",
        book: "الخروج عن النص",
        author: "محمد طه",
    },

    {
        text: "القراءة هي السفر في عوالم الآخرين، والكتابة هي دعوة الآخرين للسفر في عالمك.",
        book: "ثقافة الأسئلة",
        author: "عبد الله الغذامي",
    },
    {
        text: "لا تركز على الأهداف، بل ركز على بناء أنظمة تدعم عاداتك الإيجابية.",
        book: "العادات الذرية",
        author: "جيمس كلير",
    },
    {
        text: "تأمّل في قصص القرآن وستجد أن كل قصة تحمل رسالة ودرسًا يصلح لكل زمان ومكان.",
        book: "رسائل من القرآن",
        author: "عمرو خالد",
    },
    {
        text: "التغيير بنسبة 1% يوميًا قد يبدو ضئيلًا، لكنه يتحول إلى تحسن بنسبة 37 ضعفًا على مدار عام كامل.",
        book: "العادات الذرية",
        author: "جيمس كلير",
    },
    {
        text: "لا تخشى الخروج عن المألوف، فأعظم الإنجازات تأتي عندما نتجاوز حدود ما هو متوقع.",
        book: "الخروج عن النص",
        author: "محمد طه",
    },
    {
        text: "القرآن ليس كتابًا للتلاوة فقط، بل هو منهج حياة متكامل يخاطب العقل والقلب معًا.",
        book: "رسائل من القرآن",
        author: "عمرو خالد",
    },
    {
        text: "اكتشفي قدراتك الخفية، وأطلقي العنان لإمكاناتك، فبداخل كل امرأة قوة كامنة تنتظر من يوقظها.",
        book: "سندريلا سيكريت",
        author: "هبة السواح",
    },
    {
        text: "الكتابة ليست مجرد كلمات، بل هي إعادة تشكيل للواقع بأدوات الخيال.",
        book: "في معرفة النص",
        author: "يمنى العيد",
    },
    {
        text: "العادات الصغيرة تُحدث تغييرات كبيرة عندما تتراكم مع مرور الوقت.",
        book: "العادات الذرية",
        author: "جيمس كلير",
    },
    {
        text: "التحول الحقيقي يبدأ من الداخل، من فهمك لذاتك وقبولها كما هي قبل أن تسعى لتغييرها.",
        book: "سندريلا سيكريت",
        author: "هبة السواح",
    },
    {
        text: "حين تعتقد أنك توقفت عن التقدم، هذا يعني أنك فقط لا تلاحظ التحسينات الصغيرة التي تحدث كل يوم.",
        book: "العادات الذرية",
        author: "جيمس كلير",
    }
];
export default textsData;